#include <stdio.h>

// *************** 포인터와 배열의 호환성 ***************

int main_p14() {

    // 1차원 배열 2개
    int a0[3] = { 1,2,3 };
    int a1[3] = { 4,5,6 };

    // 2차원 배열로 표현
    // int a[2][3] = { {1,2,3}, {4,5,6} };

    // 포인터(주소) 배열
    int* pa[2] = { a0, a1 }; // 배열이니까 주소가 들어간 것.
    // int *pa[2] = { a[0], a[1] }; 

    for (int j = 0; j < 2; j++) {
        for (int i = 0; i < 3; i++) {
            // printf("%d(== %d) ",pa[j][i], *(pa[j]+i));
            // printf("%d(== %d, %d) ",pa[j][i], *(pa[j]+i), *(*(pa + j)+i));
            printf("%d(== %d, %d) ", pa[j][i], *(pa[j] + i), (*(pa + j))[i]);
        }
        printf("\n");
    }
    printf("\n");

    return 0;
}
/* 포인터형 변수의 인덱스를 이용
pa[0][0] = *(pa[0]+0) = *(*(pa+0)+0) = (*(pa+0))[0]
pa[0][1] = *(pa[0]+1) = *(*(pa+0)+1) = (*(pa+0))[1]
pa[0][2] = *(pa[0]+2) = *(*(pa+0)+2) = (*(pa+0))[2]
pa[1][0] = *(pa[1]+0) = *(*(pa+1)+0) = (*(pa+1))[0]
pa[1][1] = *(pa[1]+1) = *(*(pa+1)+1) = (*(pa+1))[1]
pa[1][2] = *(pa[1]+2) = *(*(pa+1)+2) = (*(pa+1))[2]

=> 이런 식으로 표현이 가능
*/