#include <stdio.h>
#define YEARS 3

int main_arr5() {

    /* 2017~2019년 인천 월별 평균 풍속
    12.2	14	11.2	11.9	10.4	10.1	9.4	10.4	10.1	10.8	12.2	13

    12.6	13	11.9	12.2	10.8	8.3	9.4	10.8	10.8	10.4	9.4	13

    10.8	10.4	11.9	10.4	10.8	9.4	10.4	9.7	10.1	10.1	10.8	12.2
    */
    int year3[3] = { 2017,2018,2019 };

    // 연간 월 평균풍속
    double y_2017[12] = { 12.2, 14, 11.2, 11.9, 10.4, 10.1, 9.4, 10.4, 10.1, 10.8, 12.2, 13 };
    double y_2018[12] = { 12.6, 13, 11.9, 12.2, 10.8, 8.3, 9.4, 10.8, 10.8, 10.4, 9.4, 13 };
    double y_2019[12] = { 10.8, 10.4, 11.9, 10.4, 10.8, 9.4, 10.4, 9.7, 10.1, 10.1, 10.8, 12.2 };

    // 2차원 배열로 변환
    double wind_data[YEARS][12] = {
      {12.2, 14, 11.2, 11.9, 10.4, 10.1, 9.4, 10.4, 10.1, 10.8, 12.2, 13},
      {12.6, 13, 11.9, 12.2, 10.8, 8.3, 9.4, 10.8, 10.8, 10.4, 9.4, 13},
      {10.8, 10.4, 11.9, 10.4, 10.8, 9.4, 10.4, 9.7, 10.1, 10.1, 10.8, 12.2}
    };

    printf("[ 평균 풍속 데이터 ]\n");
    printf("월 : ");
    for (int m = 0; m < 12; m++) {
        printf("\t%d ", m + 1);
    }
    printf("\n");

    for (int y = 0; y < YEARS; y++) {
        printf("연도 %d : ", year3[y]);
        for (int m = 0; m < 12; m++) {
            printf("\t%.1f", wind_data[y][m]);
        }
        printf("\n");
    }

    // 연도별 평균 풍속을 출력하세요
    printf("[ 2017~2019년도 평균 풍속 ]\n");

    for (int y = 0; y < YEARS; y++) {
        double sum = 0.0, avg;
        for (int m = 0; m < 12; m++) {
            sum += wind_data[y][m];
        }
        avg = sum / (double)12;
        printf("연도 %d : 평균 풍속 = %.1f\n", year3[y], avg);
    }

    // 3년간 월 평균 풍속을 출력하세요
    printf("[3년간 월 평균 풍속]\n");

    printf("월        : ");
    for (int m = 0; m < 12; m++) {
        printf("\t%d ", m + 1);
    }
    printf("\n");

    printf("평균 풍속  : ");
    // 월 기준으로 연도만 바뀌는 것. 월이 고정.
    for (int m = 0; m < 12; m++) {

        double sum = 0.0, avg = 0.0;
        for (int y = 0; y < YEARS; y++) {
            sum += wind_data[y][m];
        }
        avg = sum / (double)YEARS;
        printf("\t%.1f ", avg);
    }
    printf("\n");

    return 0;
}